[
  {
  "name": "UnCiv Archive – Introduction",
  "civilopediaText": [
  {"text":"Hello, I am SakiTheScout, creator of this mod. I hope you have been enjoying it so far if you have opened Tutorials after playing the game. Aiming to explain things hidden from one's eyes, I have made these tutorial. Sometimes they would contain precise numbers, but usually I will summarise things for easier understanding."},
  {"text":"This mod is, in current state, an extension of the main game. It doesn't mean I am not going to turn it into a ruleset mod, though."},
  {"text":"It adds many factions, units, policies, mechanics and other content to game, to point the gameplay feels different. The main mechanics will be explained later in other tutorials."},
  {"text":"Is this mod difficult?.. Perhaps. Sometimes you can make it to victory without much efforst, sometimes you can't quite understand what happened. This tutorial exists exactly to explain some hidden mechanics you can't really know."}
  ]
  },
  {
    "name": "UnCiv Archive – Units and Force Organisation",
    "civilopediaText": [
      {"text":"Hello again, player. If you have ever wondered, why can't I spawn tanks and artillery like AI does, this tutorial is exactly for you."},
      {"text":"What is the Force Organisation?"},
      {"text":"Force Organisation mechanic is one of the pillars this mod is held on. Units are united into 7 large groups, each having own uniques."},
      {"text":"> [Troops] is the most basic, most available kind of units. It is the important backbone of your army. Vast majority of [Troops] are [Infantry], pretty versatile units that can simply outnumber your enemy. In addition, [Troops] is also a pretty diverse unit group, including both basic [Light Infantry] and unique units like [Assault Infantry] or [Specialist Infantry]. For every 3 [Troops] you have fielded, you can produce 1 [HQ] unit."},
      {"text":"> [HQ] is the real core of your army, because without a head the body will fall. [HQ] units are represented by vast amount of commanding units, ranging from sturdy and effective [Field Captain] and fast [Light Tank Commander], to healing [Field Surgeon] and stealthy [Assassin]. But the real advantage of having as many [HQ] units as possible is that they allow you to add limited number of more specialist units from other groups. In addition, [HQ] units require much more maintenance and receive slightly less XP from combat."},
      {"text":"> [Fast Attack] is the group of units that has the greatest speed, or bonuses to mobility. It consists of such units as [Marines Infantry], [Attack Bikes] and [Light Tank]. [Fast Attack] is the assault group of units that excel on large maps and roads, outpacing most of the enemies and delivering killing blow right where you like it. It comes at a price though, making [Fast Attack] units usually fragile when defending. In addition, they require slightly more maintenance and receive less XP in combat. You may field 1 [Fast Attack] unit for each [HQ] you have."},
      {"text":"> [Fire Support] is indeed the most desired group to have, it consists of [Medium Tank], [Heavy Artillery], [Heavy Machine Gun] and other units focused on devastation. Usually, they are also not fragile at all and can very well fight back. [Fire Support] units have devastating attacks and are the first to be targeted on the battlefield after the [HQ]. In addition, [Fire Support] units require more maintenance and gain slightly less expensive from combat. You may field 1 [Fire Support] unit for every [HQ] unit."},
      {"text":"> [Elite] group contains usually the most specific units with rather niche usage. It contains vehicles, guns and infantry, each having some kind of strong unique ability making it elite and outstanding. For example, [Infiltrator Infantry] is perfect for stealth operations, infiltrations and outflanking, while [Light Machine Gun] and [Light Mortar] take care about enemy's [Infantry]. In addition, [Elite] units demand slightly greater upkeep than normal and gain less experience from combat. You may field 1 [Elite] unit for every [HQ] unit."},
      {"text":"> [Lord of War] units are the mightiest guns, the biggest threats and superunits on the field. This group is very similar to [Fire Support] in its destructive potential, but is much more powerful. In addition, [Lord of War] units hardly receive any experience and cost huge maintenance. Even single [Lord of War] unit requires 3 [HQ] units to be fielded."},
      {"text":"There is also [Fortification] group, but let's talk about it later on."},
      {"text":"---------------------------"},
      {"text":"Being done with Force Organisation, we move onto Unit Types."},
      {"text":"There are many Unit Types in the game, each having unique interactions with others."},
      {"text":"> [Infantry] and [Ranged Infantry] is the most generic Unit Type, nothing too special about it aside from lots of interactions with unique units, starting from the [Medium Machine Gun] and [Heavy Mortar] having bonuses against them, to their ability to capture [Fortifications]. Without this Unit Type, your army will be impossible."},
      {"text":"> [Towed] is the second pretty frequent to meet Unit Type, characterised with less mobility and defence exchanged for firepower. It can be truly devastating if multiple [Towed] units under cover of [Infantry] have dug in some location. [Towed] units usually have specific targets, such as cities and [Fortification] for [Heavy Artillery] and [Infantry] for [Heavy Mortar]."},
      {"text":"> [Light Armor], [Medium Armor], [Heavy Armor] and [Superheavy Armor] units can be united into category of Armored units. It consists of variety of units united by their mechanised nature. They carry big guns on fast hulls and you don't care about price already. They are not invincible though, so watch out for things like [Medium SP ATG] or [Heavy Anti-Tank Gun] hiding in bushes."},
      {"text":"> [Bike] is your perfect hit-and-run unit, it can be used as a scout too. Having bonuses against [Towed], it can be used to target enemy heavy guns standing behind frontlines, but be weary of their fragility."},
      {"text":"> [Hero] is the special unit type, specifically reserved to greatest heroes and named characters. They demand lots of [Eleph] to summon and upkeep."},
      {"text":"> [Demon] is a special unit type unique to Occult factions, added in 'the Damned and the Holy' update. Occult factions may summon them into battle by sacrificing [Eleph], but ritual has no guarateed result. Each time, there is a chance to summon a weak demon or nobody at all, or multiple entities at once. Demons also demand [Eleph] upkeep, and lose health outside combat. They can restore health by damaging or killing units."},
      {"text":"> [Fortification] is a unit type/group added in 'the Besieged' update. Fortifications are unit that cannot move, at all. How do you use them then? It's simple: I have added one-use teleport to them. In addition, most of [Fortifications] require [Foundation] improvement to be upon, and will suffer damage unless placed there. [HQ Bunker] is an example of a mixed Force Organisation slots, as it occupies both [HQ] and [Fortification] slots. There is also such unit as [Watchtower], sole purpose of which is to reveal stealth units and cover field of view, it also doesn't need [Foundation]."},
      {"text":"---------------------------"},
      {"text":"That's it, rookie. I am done explaining this stuff, get to work!"},
    ]
  },
  {
  "name": "UnCiv Archive – Happiness, Cities, Money",
  "civilopediaText": [
    {"text":"Hello again, player. Have you just dropped your Happiness below 0 and now weird things happen to your poor civilization? This tutorial will explain you why."},
    {"text":">>> The [Happiness] and its effects."},
    {"text":"[Happiness] is indeed one of the most important stats for you, especially in early game. If it drops below 0, you can no longer produce new [Settler] units and evil rebels will spawn to damage your economics. This is indeed bad, that's why you should follow these principles:"},
    {"text":"1. Always monitor [Happiness] and try to maintain it on level around 10 or above. It is relatively easy if you plan your buildings and research properly. Many buildings from school trch branch give happiness. You should also hunt luxury resources."},
    {"text":"2. Don't settle too many cities, especially when below 10 [Happiness]. It may look rewarding, but it will complicate your situation which is most likely not the best. Regulate growth of your population and always assign your population to avoid joblessness, people get angry really quickly if they have nothing to eat."},
    {"text":"3. Look through your civ's special abilities, Clubs, High Schools and their policy trees to plan your gameplay. Many High Schools have [Happiness] bonuses in their trees."},
    {"text":"If you will avoid following these principles, it is inevitable that your [Happiness] will go down. In addition to previously mentioned consequences, there are more: for every 5 Unhappiness, all stats in your cities will be lowered by 20%, excluding [Faith]. The stats will go down to -100% and be nullified."}
    {"text":">>> Special effects related to [Happiness]"},
    {"text":"As you might have guessed, there is no black without white. The main bonuses somewhat related to [Happiness] are:"},
    {"text":"1. Golden Age boosts all stats in all cities by 15%, and Strength of all units by 20%. It is incredibly valuable to start Golden Ages, especially in time of crisis."},
    {"text":"2. We Love the King Day also provides boosts for a city, them being "}
  ]
  },
  
]
