[
  {
  "name": "UnCiv Archive – Introduction",
  "civilopediaText": [
  {"text":"Hello, I am SakiTheScout, creator of this mod. I hope you have been enjoying it so far if you have opened Tutorials after playing the game. Aiming to explain things hidden from one's eyes, I have made these tutorial. Sometimes they would contain precise numbers, but usually I will summarise things for easier understanding."},
  {"text":"This mod is, in current state, an extension of the main game. It doesn't mean I am not going to turn it into a ruleset mod, though."},
  {"text":"It adds many factions, units, policies, mechanics and other content to game, to point the gameplay feels different. The main mechanics will be explained later in other tutorials."},
  {"text":"Is this mod difficult?.. Perhaps. Sometimes you can make it to victory without much efforst, sometimes you can't quite understand what happened. This tutorial exists exactly to explain some hidden mechanics you can't really know."}
  ]
  },
  {
    "name": "UnCiv Archive – Units and Force Organisation",
    "civilopediaText": [
      {"text":"Hello again, player. If you have ever wondered, why can't I spawn tanks and artillery like AI does, this tutorial is exactly for you."},
      {"text":"What is the Force Organisation?"},
      {"text":"Force Organisation mechanic is one of the pillars this mod is held on. Units are united into 7 large groups, each having own uniques."},
      {"text":"> [Troops] is the most basic, most available kind of units. It is the important backbone of your army. Vast majority of [Troops] are [Infantry], pretty versatile units that can simply outnumber your enemy. In addition, [Troops] is also a pretty diverse unit group, including both basic [Light Infantry] and unique units like [Assault Infantry] or [Specialist Infantry]. For every 3 [Troops] you have fielded, you can produce 1 [HQ] unit."},
      {"text":"> [HQ] is the real core of your army, because without a head the body will fall. [HQ] units are represented by vast amount of commanding units, ranging from sturdy and effective [Field Captain] and fast [Light Tank Commander], to healing [Field Surgeon] and stealthy [Assassin]. But the real advantage of having as many [HQ] units as possible is that they allow you to add limited number of more specialist units from other groups. In addition, [HQ] units require much more maintenance and receive slightly less XP from combat."},
      {"text":"> [Fast Attack] is the group of units that has the greatest speed, or bonuses to mobility. It consists of such units as [Marines Infantry], [Attack Bikes] and [Light Tank]. [Fast Attack] is the assault group of units that excel on large maps and roads, outpacing most of the enemies and delivering killing blow right where you like it. It comes at a price though, making [Fast Attack] units usually fragile when defending. In addition, they require slightly more maintenance and receive less XP in combat. You may field 1 [Fast Attack] unit for each [HQ] you have."},
      {"text":"> [Fire Support] is indeed the most desired group to have, it consists of [Medium Tank], [Heavy Artillery], [Heavy Machine Gun] and other units focused on devastation. Usually, they are also not fragile at all and can very well fight back. [Fire Support] units have devastating attacks and are the first to be targeted on the battlefield after the [HQ]. In addition, [Fire Support] units require more maintenance and gain slightly less expensive from combat. You may field 1 [Fire Support] unit for every [HQ] unit."},
      {"text":"> [Elite] group contains usually the most specific units with rather niche usage. It contains vehicles, guns and infantry, each having some kind of strong unique ability making it elite and outstanding. For example, [Infiltrator Infantry] is perfect for stealth operations, infiltrations and outflanking, while [Light Machine Gun] and [Light Mortar] take care about enemy's [Infantry]. In addition, [Elite] units demand slightly greater upkeep than normal and gain less experience from combat. You may field 1 [Elite] unit for every [HQ] unit."},
      {"text":"> [Lord of War] units are the mightiest guns, the biggest threats and superunits on the field. This group is very similar to [Fire Support] in its destructive potential, but is much more powerful. In addition, [Lord of War] units hardly receive any experience and cost huge maintenance. Even single [Lord of War] unit requires 3 [HQ] units to be fielded."},
      {"text":"There is also [Fortification] group, but let's talk about it later on."},
      {"text":"---------------------------"},
      {"text":"Being done with Force Organisation, we move onto Unit Types."},
      {"text":"There are many Unit Types in the game, each having unique interactions with others."},
      {"text":"> [Infantry] and [Ranged Infantry] is the most generic Unit Type, nothing too special about it aside from lots of interactions with unique units, starting from the [Medium Machine Gun] and [Heavy Mortar] having bonuses against them, to their ability to capture [Fortifications]. Without this Unit Type, your army will be impossible."},
      {"text":"> [Towed] is the second pretty frequent to meet Unit Type, characterised with less mobility and defence exchanged for firepower. It can be truly devastating if multiple [Towed] units under cover of [Infantry] have dug in some location. [Towed] units usually have specific targets, such as cities and [Fortification] for [Heavy Artillery] and [Infantry] for [Heavy Mortar]."},
      {"text":"> [Light Armor], [Medium Armor], [Heavy Armor] and [Superheavy Armor] units can be united into category of Armored units. It consists of variety of units united by their mechanised nature. They carry big guns on fast hulls and you don't care about price already. They are not invincible though, so watch out for things like [Medium SP ATG] or [Heavy Anti-Tank Gun] hiding in bushes."},
      {"text":"> [Bike] is your perfect hit-and-run unit, it can be used as a scout too. Having bonuses against [Towed], it can be used to target enemy heavy guns standing behind frontlines, but be weary of their fragility."},
      {"text":"> [Hero] is the special unit type, specifically reserved to greatest heroes and named characters. They demand lots of [Eleph] to summon and upkeep."},
      {"text":"> [Demon] is a special unit type unique to Occult factions, added in 'the Damned and the Holy' update. Occult factions may summon them into battle by sacrificing [Eleph], but ritual has no guarateed result. Each time, there is a chance to summon a weak demon or nobody at all, or multiple entities at once. Demons also demand [Eleph] upkeep, and lose health outside combat. They can restore health by damaging or killing units."},
      {"text":"> [Fortification] is a unit type/group added in 'the Besieged' update. Fortifications are unit that cannot move, at all. How do you use them then? It's simple: I have added one-use teleport to them. In addition, most of [Fortifications] require [Foundation] improvement to be upon, and will suffer damage unless placed there. [HQ Bunker] is an example of a mixed Force Organisation slots, as it occupies both [HQ] and [Fortification] slots. There is also such unit as [Watchtower], sole purpose of which is to reveal stealth units and cover field of view, it also doesn't need [Foundation]."},
      {"text":"---------------------------"},
      {"text":"That's it, rookie. I am done explaining this stuff, get to work!"},
    ]
  },
  {
  "name": "UnCiv Archive – Happiness, Cities, Money",
  "civilopediaText": [
    {"text":"Hello again, player. Have you just dropped your Happiness below 0 and now weird things happen to your poor civilization? This tutorial will explain you why."},
    {"text":">>> The [Happiness] and its effects."},
    {"text":"[Happiness] is indeed one of the most important stats for you, especially in early game. If it drops below 0, you can no longer produce new [Settler] units and evil rebels will spawn to damage your economics. This is indeed bad, that's why you should follow these principles:"},
    {"text":"1. Always monitor [Happiness] and try to maintain it on level around 10 or above. It is relatively easy if you plan your buildings and research properly. Many buildings from school trch branch give happiness. You should also hunt luxury resources."},
    {"text":"2. Don't settle too many cities, especially when below 10 [Happiness]. It may look rewarding, but it will complicate your situation which is most likely not the best. Regulate growth of your population and always assign your population to avoid joblessness, people get angry really quickly if they have nothing to eat."},
    {"text":"3. Look through your civ's special abilities, Clubs, High Schools and their policy trees to plan your gameplay. Many High Schools have [Happiness] bonuses in their trees."},
    {"text":"If you will avoid following these principles, it is inevitable that your [Happiness] will go down. In addition to previously mentioned consequences, there are more: for every 5 Unhappiness, all stats in your cities will be lowered by 20%, including Growth and excluding [Faith]. The stats will go down to -100% and be nullified."},
    {"text":"As you might have guessed, there is no black without white. Golden Age boosts all stats in all cities by 30%, and Strength of all units by 20%. It is incredibly valuable to start Golden Ages, especially in time of crisis."},
    {"text":"---------------------------"},
    {"text":">>> The [Gold] Shortage and its mechanic."},
    {"text":"This mod does not allow you to run a debt economy. Lacking [Gold] in your coffers hugely affects the most important stats in game: [Happiness] and Strength of your units. These two stats will progressively decrease depending on the amount of your current debt. In case with [Happiness], it also makes it harder to actually go 0 again."},
    {"text":"---------------------------"},
    {"text":">>> The Cities and their mechanics in mod."},
    {"text":"Little has escaped reworks and reimagination. Here are two main mechanics related to Cities:"},
    {"text":"1. Capital is not only usually the biggest and longest lasting city, but also a subject to a 15% buff for all stats. This is quite generous, but also means that taking out capitals is harder and more valuable."},
    {"text":"2. With progress of eras, Cities will have slight bonus of 5% to all stats except for Growth and [Happiness] which are not affected, [Science] and [Faith] which are instead decreased by 5%."},
    {"text":"---------------------------"},
    {"text":"That's it for now, have good luck balancing your gameplay!"},
  ]
  },
  {
  "name": "UnCiv Archive – High Schools, Clubs and Policy Trees",
  "civilopediaText": [
    {"text":"Hello again, player. I suppose you have already peeked inside of the Policies menu and choked on your tea looking at the generous amount of new policy trees. But don't get too excited."},
    {"text":">>> High Schools, general introduction."},
    {"text":"After researching a specific tech called High Schools in the new tech branch, you unlock one of the most important mechanics in the mod: the High Schools. To build one, you first must build [Elementary School] and [Middle School] buildings in a city. They will give you slight boosts despite biting price. But more importantly, they will allow you to choose a High School."},
    {"text":"What is a High School for your civilization? It is a separate school inside of your faction, most likely a vassal to major school/corporation/nation/gang. In exchange for protection, they will train your units according to their curriculums, providing unique and useful bonuses. Depending on a school, these bonuses will be more or less peaceful, but in general they are all useful. You may have only one High School in your city, so you must choose carefully."},
    {"text":"There are many High Schools, and even more Appendix Buildings available after researching School Logistics I and II techs. Each High School has own dedicated Policy tree."},
    {"text":"---------------------------"},
    {"text":">>> Policy Trees of High Schools."},
    {"text":"Gameplay-shaping, mutually exclusive policy trees that circle around specific kind of High School, providing either thematic bonuses or directly interacting with the school."},
    {"text":"It is crucial to choose a policy tree that will match your gamestyle, because there will be no going back. Each tree has unique structure and ways to provide you bonuses. All trees are concentrated on schools, and usually affect their respective Schooling units, for example giving them more strength or providing stats depending on number of the units."},
    {"text":"It is also preferable to choose policy tree basing off your current civilization to achieve absolute synergy."},
    {"text":"---------------------------"},
    {"text":">>> Clubs of the factions."},
    {"text":"Many schools have their own Clubs, which are more characteristic for Greater Schools. Clubs, just like High Schools, are mutually exclusive so that you may have only one Club per city. Each club has unique bonuses and drawbacks as well as many mechanics tied around them."},
    {"text":"Clubs are unique to each school (at least until I make universal clubs) and in fact are the main unique your civilization has. Carefully navigate the Clubs of your chosen civilization. Each has unique time to unlock the clubs, for example [Trinity General School] unlocks them after researching Civil Service while [Red Winter Federal Academy] has to wait until Industrialization."},
    {"text":"Clubs also usually engage in unique mechanics of each civilization. For example [Abydos High School] has only one club – Foreclosive Task Force. It is dedicated to fight off the Desertification, which inevitably starts consuming Abydos since Atomic era. It is important to have as many as possible. [Trinity General School] unlocks special choices for Tea Party Host during their unique event by building clubs."},
    {"text":"Not only do the Clubs shape your economics and engage in mechanics, they also provide powerful promotions for units built in there. The effect may range from purely peaceful to purely combat, and balancing off these Clubs in your roster is crucial for winning."},
    {"text":"---------------------------"},
    {"text":"I hope I have provided thorough but generalized explanation to the High Schools and Clubs. I am sure you will be able to read more about them on your own."},
  ]
  },
  {
  "name": "UnCiv Archive – Factional Tags, Subtags",
  "civilopediaText": [
    {"text":"Hello again, player. I suppose you have seen the strange words like Greater School, Lesser School, Occult on the top of Civ's unique. These are the Factional Tags. In short, they designate what exactly this faction is within Kivotos."},
    {"text":">>> Greater School"},
    {"text":"Greater Schools in Kivotos are centres of major political power. They usually consolidate majority of firepower and influence in entirety of Academy City. There are 7 Great Schools: [Abydos High School], [Trinity General School], [Gehenna Academy], [Shanhaijing Second Senior School], [Hyakkiyako Alliance Academy], [Millennium Science School] and [Red Winter Federal Academy], Greater Schools with immense power in this 17.000.000km² region."},
    {"text":"Greater Schools have greater borders than other civilizations and don't suffer as much [Happiness] debuff from number of cities, but suffer more Unhappiness from specialists and struggle to consolidate their culture."},
    {"text":"Greater School's units also have [Kivotos Halo] being students of Kivotos."},
    {"text":"---------------------------"},
    {"text":">>> Lesser School"},
    {"text":"Not all schools in Kivotos are in size of France. Vast majority, in fact, occupy land equal to a major region within a country. They usually have much less resources and fame, but it doesn't make them defenceless: even the Greater Schools struggle to conquer them. That's why in current state, Kivotos has no ultimate ruler and the constant feuds between schools will never come to and end. Lesser schools may also have their own vassal High Schools."},
    {"text":"Lesser Schools have smaller territory and number of cities as their population is much more consolidated than that of Greater Schools, which allows more effective adoption of policies and election of specialists."},
    {"text":"Just like Greater Schools, Lesser School consist of students and have [Kivotos Halo] on units."},
    {"text":"---------------------------"},
    {"text":">>> Corporation"},
    {"text":"Not all powers in Kivotos are purely made of students. In modern era, many businesses have turned their gazes onto the Academy City and its abundant resources. Through it may be hard for them to navigate feuds and chaos of this place, many international corporations have established stable footholds in Kivotos' economics."},
    {"text":"Corporations have incredible [Gold] incomes in their cities, at cost of decreasing other stats."},
  ]
  }
]
